#include "Header.h"

void table(string no) {

	cout << "   ------------------------------------\f";
	cout << "   |     таблица номеров ячеек        |\f";
	cout << "   ------------------------------------\f";
	cout << "   |        1   |    2    |   3       |\f";
	cout << "   ------------------------------------\f";
	cout << "   |        4   |    5    |   6       |\f";
	cout << "   ------------------------------------\f";
	cout << "   |        7   |    8    |   9       |\f";
	cout << "   ------------------------------------\f";
	cout << endl;

	cout << "   ------------------------------------\f";
	cout << "   | таблица промежуточного результата|\f";
	cout << "   ------------------------------------\f";
	cout << "   |        " << no << "   |    " << no << "    |   " << no << "       |\f";
	cout << "   ------------------------------------\f";
	cout << "   |        " << no << "   |    " << no << "    |   " << no << "       |\f";
	cout << "   ------------------------------------\f";
	cout << "   |        " << no << "   |    " << no << "    |   " << no << "       |\f";
	cout << "   ------------------------------------\f";
	cout << endl;
}

void winn() {

	cout << "   ---------------------------------------------\f";
	cout << "   | ПОЗДРАВЛЯЮ, У НАС ЕСТЬ ПОБЕДИТЕЛЬ (~•_•)~ |\f";
	cout << "   ---------------------------------------------\f";

}

void game() {

	string no = { 'x' };
	string name1, name2;
	int co = 0, move, number, n = 3, difference = 0, winner = 0, odd = 0/*нечётные*/, even = 0/*чётные*/;
	int arr[10][10];
	int err[8];

	//ввод имён игроков
	cout << endl << "  Введите имена игроков. " << endl << "  Введите имя игрока 1 (нечётный): "; cin >> name1;
	cout << "  Введите имя игрока 2 (чётный): "; cin >> name2;
	cout << endl;

	cout << endl << endl << "  Игра началась. Первым ходит нечётный игрок." << endl << endl;

	for (int i = 0; i < n; i++)
		for (int j = 0; j < n; j++) {
			arr[i][j] = -1;
		}

	//вывод начальных таблиц
	table(no);

	for (int i = 0; i < 9; i++) {

		co += 1;
		if (co % 2 != 0) cout << "  Ход № " << co << ". Сейчас ходит " << name1 << "." << endl << endl;
		if (co % 2 == 0) cout << "  Ход № " << co << ". Сейчас ходит " << name2 << "." << endl << endl;
		cout << "  Введите значение для хода - 0 или 1. \n  Если Вы забыли правила игры и хотите освежить память, нажмите 2." << endl;
		do {
			cout << "  Значение для хода : ";
			cin >> move;
			cout << endl;
			if (move == 2) {
				cout << endl << endl << "  Правила игры чёт - нечёт" << endl << "  - Два игрока, «нечетный» и «четный», по очереди ставят единицы и нули в незанятые позиции поля 3 на 3." << endl << "  - Каждый из игроков может ставить 1 или 0 в произвольную свободную позицию, тем самым занимая ее." << endl << "  - Игра продолжается до заполнения всех позиций. После этого суммируются числа вдоль каждой строки, каждого столбца и главных диагоналей." << endl << "  - Число ODD нечетных сумм сравнивается с числом EVEN четных сумм." << endl << "  - Если ODD > EVEN, выигрывает «нечетный»; если EVEN > ODD, выигрывает «четный»; если ODD = EVEN, результат считается ничейным." << endl << endl;
			}
			if ((move > 2) || (move < 0)) cout << "  Введённое значение не соответствует правилам. Попробуйте снова." << endl << endl;
		} while ((move > 1) || (move < 0));

		do {
			cout << "  Введите номер ячейки - от 1 до 9: ";
			cin >> number;
			cout << endl;
			if ((number > 9) || (number < 1)) cout << "  Введённое значение не соответствует правилам. Попробуйте снова." << endl << endl;
		} while ((number > 9) || (number < 1));

		switch (number) {
		case 1:
			if (arr[0][0] < 0) {
				arr[0][0] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 2:
			if (arr[0][1] < 0) {
				arr[0][1] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 3:
			if (arr[0][2] < 0) {
				arr[0][2] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 4:
			if (arr[1][0] < 0) {
				arr[1][0] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 5:
			if (arr[1][1] < 0) {
				arr[1][1] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 6:
			if (arr[1][2] < 0) {
				arr[1][2] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 7:
			if (arr[2][0] < 0) {
				arr[2][0] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 8:
			if (arr[2][1] < 0) {
				arr[2][1] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		case 9:
			if (arr[2][2] < 0) {
				arr[2][2] = move;
			}
			else {
				cout << "  Эта ячейка уже занята, выберите другую ячейку!" << endl << endl; co -= 1; i -= 1;
			} break;
		}

		//вывод промежуточных результатов
		cout << "   ------------------------------------\f";
		cout << "   |таблица промежуточного результата |\f";
		cout << "   ------------------------------------\f";
		cout << "   |        ";
		if (arr[0][0] >= 0) cout << arr[0][0];
		else { cout << no; };
		cout << "   |    ";
		if (arr[0][1] >= 0) cout << arr[0][1];
		else { cout << no; }
		cout << "    |   ";
		if (arr[0][2] >= 0) cout << arr[0][2];
		else { cout << no; }
		cout << "       |\f";
		cout << "   ------------------------------------\f";
		cout << "   |        ";
		if (arr[1][0] >= 0) cout << arr[1][0];
		else { cout << no; };
		cout << "   |    ";
		if (arr[1][1] >= 0) cout << arr[1][1];
		else { cout << no; }
		cout << "    |   ";
		if (arr[1][2] >= 0) cout << arr[1][2];
		else { cout << no; }
		cout << "       |\f";
		cout << "   ------------------------------------\f";
		cout << "   |        ";
		if (arr[2][0] >= 0) cout << arr[2][0];
		else { cout << no; };
		cout << "   |    ";
		if (arr[2][1] >= 0) cout << arr[2][1];
		else { cout << no; }
		cout << "    |   ";
		if (arr[2][2] >= 0) cout << arr[2][2];
		else { cout << no; }
		cout << "       |\f";
		cout << "   ------------------------------------\f";
		cout << endl;
	}

	//самый простой подсчёт сумм чисел на конкретных позициях
	err[0] = arr[0][0] + arr[0][1] + arr[0][2];
	err[1] = arr[1][0] + arr[1][1] + arr[1][2];
	err[2] = arr[2][0] + arr[2][1] + arr[2][2];
	err[3] = arr[0][0] + arr[1][0] + arr[2][0];
	err[4] = arr[0][1] + arr[1][1] + arr[2][1];
	err[5] = arr[0][2] + arr[1][2] + arr[2][2];
	err[6] = arr[0][0] + arr[1][1] + arr[2][2];
	err[7] = arr[0][2] + arr[1][1] + arr[2][0];

	//подсчёт количества чётных и нечётных сумм
	for (int i = 0; i < 8; i++)
	{
		if (err[i] % 2 != 0) odd += 1;
		if (err[i] % 2 == 0) even += 1; // + считаем сумму, равную нулю за чётное число (потому что так сказано в гугле)
	}
	cout << endl << "  Партия окончена!" << endl;
	cout << endl << "  Количество чётных сумм: " << even << endl;
	cout << "  Количество нечётных сумм: " << odd << endl;
	cout << endl << "  Результат:" << endl << endl;

	//если чётных больше
	if (even > odd) {
		difference = even - odd;
		winn();
		cout << endl << "   Победитель - игрок " << name2 << endl << endl;
		cout << "   ---------------------------------------------\f";
		cout << "   |       таблица конечного результата        |\f";
		cout << "   ---------------------------------------------\f";
		cout << "   |            Набрано " << even << " очков!               |\f";
		cout << "   ---------------------------------------------\f";
		cout << "   |     Чётных больше, чем нечётных на " << difference << ".     |\f";
		cout << "   ---------------------------------------------\f";
	}
	//если нечётных больше
	if (odd > even) {
		difference = odd - even;
		winn();
		cout << endl << "   Победитель - игрок " << name1 << endl << endl;
		cout << "   ---------------------------------------------\f";
		cout << "   |       таблица конечного результата        |\f";
		cout << "   ---------------------------------------------\f";
		cout << "   |            Набрано " << odd << " очков!               |\f";
		cout << "   ---------------------------------------------\f";
		cout << "   |     Нечётных больше, чем чётных на " << difference << ".     |\f";
		cout << "   ---------------------------------------------\f";
	}

	//ничья
	if (even == odd) {
		cout << "   ---------------------------------------------\f";
		cout << "   |       таблица конечного результата        |\f";
		cout << "   ---------------------------------------------\f";
		cout << "   |    Хм... Ничья (•_•). Возьмёте реванш?)   |\f";
		cout << "   ---------------------------------------------\f";
	}

}